def to_words(n):
    units = ['один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять']
    tens = ['двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят',
            'восемьдесят', 'девяносто']
    hundreds = ['сто', 'двести', 'триста', 'четыреста', 'пятьсот', 'шестьсот',
                'семьсот', 'восемьсот', 'девятьсот']
    special = ['десять', 'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать',
               'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать', 'тысяча']
    output = ''
    if n < 1 or n > 1000:
        return

    if n == 1000:
        output = special[-1]
    else:
        if n >= 100:
            output += hundreds[n//100 - 1] + ' '
            n %= 100
        if n >= 20:
            output += tens[n//10 - 2] + ' '
            n %= 10

        if 0 < n < 10:
            output += units[n - 1]
        elif n > 0:
            output += special[n % 10]
    return output


a = int(input('числоооо:\n'))
while a != 0:
    print(to_words(a))
    a = int(input())
